; domain
(define (domain warehouse)
  (:requirements :strips :typing :negative-preconditions)
  (:types product product-type command worker)
  
  (:predicates 
      (in-inventory ?p - product)
      (assigned ?p - product ?c - command)
      (free ?w - worker)
      (working-on ?w - worker ?c - command)
      (command-complete ?c - command)
      (order-label-printed ?c - command)
      (command-in-progress ?c - command)
      (type-scanned ?t - product-type ?c - command) ;; Scanned a type for a specific command
      (order-label-scanned ?c - command)
      (is-type ?p - product ?t - product-type)      ;; Links item to type
  )

  (:action New-mission-PDA
      :parameters (?w - worker ?c - command)
      :precondition (and (free ?w) (not (command-complete ?c)) (not (command-in-progress ?c)))
      :effect (and (not (free ?w)) (working-on ?w ?c) (command-in-progress ?c))
  )

  (:action Print-Order-Label
      :parameters (?w - worker ?c - command)
      :precondition (and (working-on ?w ?c) (not (order-label-printed ?c)))
      :effect (order-label-printed ?c)
  )

  ;; Scan the TYPE, not the item.
  (:action Scan-Item-Type-Barcode
      :parameters (?t - product-type ?c - command ?w - worker)
      :precondition (working-on ?w ?c)
      :effect (type-scanned ?t ?c)
  )

  (:action add-to-order
      :parameters (?p - product ?t - product-type ?c - command ?w - worker)
      :precondition (and (working-on ?w ?c) 
                         (order-label-printed ?c) 
                         (is-type ?p ?t)
                         (type-scanned ?t ?c) 
                         (in-inventory ?p))
      :effect (and (not (in-inventory ?p)) (assigned ?p ?c))
  )

  (:action finish-order-scanned
      :parameters (?w - worker ?c - command)
      :precondition (and (working-on ?w ?c) (order-label-printed ?c))
      :effect (and (free ?w) (not (working-on ?w ?c)) (not (command-in-progress ?c)) (command-complete ?c) (order-label-scanned ?c))
  )
)

; problem
(define (problem daily-orders)
  (:domain warehouse)
  (:objects 
      a1 a2 a3 a4 a5 a6 a7 a8 a9 a10 - product
      b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - product
      c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - product
      typeA typeB typeC - product-type
      cmd1 cmd2 cmd3 - command
      worker1 worker2 - worker
  )
  
  (:init 
      ;; Workers are ready
      (free worker1)
      (free worker2)
      
      ;; Inventory stock
      (in-inventory a1) (in-inventory a2) (in-inventory a3) (in-inventory a4) (in-inventory a5)
      (in-inventory a6) (in-inventory a7) (in-inventory a8) (in-inventory a9) (in-inventory a10)
      (in-inventory b1) (in-inventory b2) (in-inventory b3) (in-inventory b4) (in-inventory b5)
      (in-inventory b6) (in-inventory b7) (in-inventory b8) (in-inventory b9) (in-inventory b10)
      (in-inventory c1) (in-inventory c2) (in-inventory c3) (in-inventory c4) (in-inventory c5)
      (in-inventory c6) (in-inventory c7) (in-inventory c8) (in-inventory c9) (in-inventory c10)

      ;; Define product types
      (is-type a1 typeA) (is-type a2 typeA) (is-type a3 typeA) (is-type a4 typeA) (is-type a5 typeA)
      (is-type a6 typeA) (is-type a7 typeA) (is-type a8 typeA) (is-type a9 typeA) (is-type a10 typeA)
      (is-type b1 typeB) (is-type b2 typeB) (is-type b3 typeB) (is-type b4 typeB) (is-type b5 typeB)
      (is-type b6 typeB) (is-type b7 typeB) (is-type b8 typeB) (is-type b9 typeB) (is-type b10 typeB)
      (is-type c1 typeC) (is-type c2 typeC) (is-type c3 typeC) (is-type c4 typeC) (is-type c5 typeC)
      (is-type c6 typeC) (is-type c7 typeC) (is-type c8 typeC) (is-type c9 typeC) (is-type c10 typeC)
  )
  
  (:goal (and 
      ;; Command 1: 2a, 1b, 1c
      (assigned a1 cmd1) (assigned a2 cmd1) (assigned b1 cmd1) (assigned c1 cmd1)
      (command-complete cmd1) (order-label-scanned cmd1)
      
      ;; Command 2: 3b, 1c
      (assigned b2 cmd2) (assigned b3 cmd2) (assigned b4 cmd2) (assigned c2 cmd2)
      (command-complete cmd2) (order-label-scanned cmd2)
      
      ;; Command 3: 5a
      (assigned a3 cmd3) (assigned a4 cmd3) (assigned a5 cmd3) (assigned a6 cmd3) (assigned a7 cmd3)
      (command-complete cmd3) (order-label-scanned cmd3)
  ))
)

; plan
1. (new-mission-pda worker2 cmd1)
   deleted: (free worker2)
   added: (working-on worker2 cmd1) (command-in-progress cmd1)
   goals met: 0 of 19
2. (print-order-label worker2 cmd1)
   added: (order-label-printed cmd1)
   goals met: 0 of 19
3. (scan-item-type-barcode typea cmd1 worker2)
   added: (type-scanned typea cmd1)
   goals met: 0 of 19
4. (scan-item-type-barcode typeb cmd1 worker2)
   added: (type-scanned typeb cmd1)
   goals met: 0 of 19
5. (scan-item-type-barcode typec cmd1 worker2)
   added: (type-scanned typec cmd1)
   goals met: 0 of 19
6. (add-to-order a1 typea cmd1 worker2)
   deleted: (in-inventory a1)
   added: (assigned a1 cmd1)
   goals met: 1 of 19
7. (add-to-order a2 typea cmd1 worker2)
   deleted: (in-inventory a2)
   added: (assigned a2 cmd1)
   goals met: 2 of 19
8. (add-to-order b1 typeb cmd1 worker2)
   deleted: (in-inventory b1)
   added: (assigned b1 cmd1)
   goals met: 3 of 19
9. (add-to-order c1 typec cmd1 worker2)
   deleted: (in-inventory c1)
   added: (assigned c1 cmd1)
   goals met: 4 of 19
10. (finish-order-scanned worker2 cmd1)
   deleted: (working-on worker2 cmd1) (command-in-progress cmd1)
   added: (free worker2) (command-complete cmd1) (order-label-scanned cmd1)
   goals met: 6 of 19
11. (new-mission-pda worker2 cmd2)
   deleted: (free worker2)
   added: (working-on worker2 cmd2) (command-in-progress cmd2)
   goals met: 6 of 19
12. (print-order-label worker2 cmd2)
   added: (order-label-printed cmd2)
   goals met: 6 of 19
13. (scan-item-type-barcode typeb cmd2 worker2)
   added: (type-scanned typeb cmd2)
   goals met: 6 of 19
14. (scan-item-type-barcode typec cmd2 worker2)
   added: (type-scanned typec cmd2)
   goals met: 6 of 19
15. (add-to-order b2 typeb cmd2 worker2)
   deleted: (in-inventory b2)
   added: (assigned b2 cmd2)
   goals met: 7 of 19
16. (add-to-order b3 typeb cmd2 worker2)
   deleted: (in-inventory b3)
   added: (assigned b3 cmd2)
   goals met: 8 of 19
17. (add-to-order b4 typeb cmd2 worker2)
   deleted: (in-inventory b4)
   added: (assigned b4 cmd2)
   goals met: 9 of 19
18. (add-to-order c2 typec cmd2 worker2)
   deleted: (in-inventory c2)
   added: (assigned c2 cmd2)
   goals met: 10 of 19
19. (finish-order-scanned worker2 cmd2)
   deleted: (working-on worker2 cmd2) (command-in-progress cmd2)
   added: (free worker2) (command-complete cmd2) (order-label-scanned cmd2)
   goals met: 12 of 19
20. (new-mission-pda worker2 cmd3)
   deleted: (free worker2)
   added: (working-on worker2 cmd3) (command-in-progress cmd3)
   goals met: 12 of 19
21. (print-order-label worker2 cmd3)
   added: (order-label-printed cmd3)
   goals met: 12 of 19
22. (scan-item-type-barcode typea cmd3 worker2)
   added: (type-scanned typea cmd3)
   goals met: 12 of 19
23. (add-to-order a3 typea cmd3 worker2)
   deleted: (in-inventory a3)
   added: (assigned a3 cmd3)
   goals met: 13 of 19
24. (add-to-order a4 typea cmd3 worker2)
   deleted: (in-inventory a4)
   added: (assigned a4 cmd3)
   goals met: 14 of 19
25. (add-to-order a5 typea cmd3 worker2)
   deleted: (in-inventory a5)
   added: (assigned a5 cmd3)
   goals met: 15 of 19
26. (add-to-order a6 typea cmd3 worker2)
   deleted: (in-inventory a6)
   added: (assigned a6 cmd3)
   goals met: 16 of 19
27. (add-to-order a7 typea cmd3 worker2)
   deleted: (in-inventory a7)
   added: (assigned a7 cmd3)
   goals met: 17 of 19
28. (finish-order-scanned worker2 cmd3)
   deleted: (working-on worker2 cmd3) (command-in-progress cmd3)
   added: (free worker2) (command-complete cmd3) (order-label-scanned cmd3)
   goals met: 19 of 19
